БПКР/src/Documents/ОтчетПоЗакупочнымАктам/ОтчетПоЗакупочнымАктам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоЗакупочнымАктам</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупочныйАкт</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/AccumulationRegisters/ДанныеЗакупочныхАктов/ДанныеЗакупочныхАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеЗакупочныхАктов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/Documents/ОтчетПоЗакупочнымАктам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецКвартала(ТекущаяДатаСеанса());
	Иначе
		Дата = КонецКвартала(Дата);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Предварительный контроль
	ВыполнитьПредварительныйКонтроль(Отказ);	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоЗакупочнымАктам.Ссылка
		|ИЗ
		|	Документ.ОтчетПоЗакупочнымАктам КАК ОтчетПоЗакупочнымАктам
		|ГДЕ
		|	НЕ ОтчетПоЗакупочнымАктам.ПометкаУдаления
		|	И ОтчетПоЗакупочнымАктам.Дата = &Дата
		|	И ОтчетПоЗакупочнымАктам.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'За указанный квартал уже сформирован закупочный акт.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПрогрманыеСлужебныеПроцедурыИФункции

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧасть() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеЗакупочныхАктовОбороты.Период КАК Дата,
		|	ДанныеЗакупочныхАктовОбороты.Регистратор КАК Документ,
		|	ДанныеЗакупочныхАктовОбороты.Контрагент КАК Контрагент,
		|	ДанныеЗакупочныхАктовОбороты.Товар КАК Товар,
		|	ДанныеЗакупочныхАктовОбороты.Номер КАК Номер,
		|	ДанныеЗакупочныхАктовОбороты.КоличествоОборот КАК Количество,
		|	ДанныеЗакупочныхАктовОбороты.СуммаОборот КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаЗакупочныеАкты
		|ИЗ
		|	РегистрНакопления.ДанныеЗакупочныхАктов.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Организация = &Организация) КАК ДанныеЗакупочныхАктовОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗакупочныеАкты.Дата КАК Дата,
		|	ВременнаяТаблицаЗакупочныеАкты.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаЗакупочныеАкты.Товар КАК Товар,
		|	ВременнаяТаблицаЗакупочныеАкты.Номер КАК Номер,
		|	ВременнаяТаблицаЗакупочныеАкты.Количество КАК Количество,
		|	ВременнаяТаблицаЗакупочныеАкты.Сумма КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаЗакупочныеАкты КАК ВременнаяТаблицаЗакупочныеАкты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер,
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаЗакупочныеАкты.Документ) КАК Количество
		|ИЗ
		|	ВременнаяТаблицаЗакупочныеАкты КАК ВременнаяТаблицаЗакупочныеАкты";
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоКвартала(Дата));
	Запрос.УстановитьПараметр("КонецПериода", 	Дата);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СуммаДокумента = 0;
	
	// Заполнение ТЧ "Закупочный акт".
	ТаблицаДанных = МассивРезультатов[1].Выгрузить();
	
	ЗакупочныйАкт.Загрузить(ТаблицаДанных);
		
	СуммаДокумента = ТаблицаДанных.Итог("Сумма");
	
	// Заполнение количества закучопных актов.
	Выборка = МассивРезультатов[2].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
